Repository: City-of-Helsinki/kaavapino
Catalog: kaavapino/locale/*/LC_MESSAGES/django.po
Languages: fi

source: initial calculation
fi: alkulaskutoimitus

source: initial calculations
fi: alkulaskutoimitukset

source: update calculation
fi: päivityslaskutoimitus

source: update calculations
fi: päivityslaskutoimitukset

source: Please select only one project.
fi: Valitse vain yksi projekti

source: Create document {}
fi: Luo dokumentti {}

source: choose one template
fi: valitse yksi dokumenttipohja

source: set_project_card_default_template
fi: aseta projektikortin dokumenttipohjaksi

source: created at
fi: luotu

source: modified at
fi: muokattu

source: permanent
fi: tallennetaan pysyvästi

source: while processing
fi: prosessinaikainen

source: custom duration after archival
fi: määriteltävä ajanjakso arkistoinnin jälkeen

source: years
fi: vuotta

source: months
fi: kuukautta

source: days
fi: päivää

source: label
fi: nimike

source: plan type
fi: säilytyssuunnitelman tyyppi

source: custom time
fi: määritelty ajanjakso

source: unit for custom time
fi: ajanjakson yksikkö

source: fieldset
fi: kenttäryhmä

source: integer
fi: kokonaisluku

source: decimal
fi: desimaaliluku

source: short string
fi: lyhyt teksti

source: long string
fi: pitkä teksti

source: rich text
fi: pitkä muotoiltu teksti

source: short rich text
fi: lyhyt muotoiltu teksti

source: boolean
fi: totuusarvo

source: date
fi: päivämäärä

source: user
fi: käyttäjä

source: personnel
fi: henkilökunta

source: geometry
fi: rajaus

source: image
fi: kuva

source: file
fi: tiedosto

source: link
fi: linkki

source: choice
fi: valinta

source: default
fi: oletus

source: dropdown
fi: pudotusvalikko

source: checkbox
fi: valintaruutu

source: read only
fi: vain luku

source: read only checkbox
fi: valintaruutu, vain luku

source: integer without thousand separator
fi: kokonaisluku ilman tuhaterotinta

source: Same as parent fieldset
fi: Sama kuin emokenttäryhmällä

source: name
fi: nimi

source: value type
fi: arvon tyyppi

source: display style
fi: näyttötyyli

source: show attribute if any condition applies
fi: näytä kenttä jos jokin ehto pätee

source: visibility condition
fi: ehto näkyvyydelle

source: hide attribute if any condition applies
fi: piilota kenttä jos jokin ehto pätee

source: hide condition
fi: piilota ehto

source: unit
fi: yksikkö

source: public information
fi: julkinen tieto

source: searchable field
fi: hakukenttä

source: generated
fi: automaattisesti generoitu

source: data retention plan
fi: datan säilytysaika

source: required
fi: pakollinen

source: multiple choice
fi: monivalinta

source: character limit
fi: merkkiraja

source: placeholder text
fi: tyhjän kentän ohjeteksti

source: unique
fi: uniikki

source: error message
fi: virheilmoitus

source: identifier
fi: tunniste

source: Help text
fi: ohjeteksti

source: Help link
fi: ohjelinkki

source: read-only autofill field
fi: automaattisesti täytettynä vain luku

source: autofill rule
fi: automaattisen täytön sääntö

source: updates related autofill fields
fi: päivittää kenttään liittyvät automaattisesti kentät

source: highlight field for group
fi: korostustettava kenttä ryhmälle

source: owner can edit
fi: projektin vastuuhenkilö voi muokata

source: owner can view
fi: projektin vastuuhenkilö voi tarkastella

source: privilege for viewing
fi: katseluoikeus

source: privilege for editing
fi: muokkausoikeus

source: external data source
fi: ulkoinen datalähde

source: field key for external data source
fi: kentän avain ulkoiselle datalähteelle

source: key attribute for fetching external data
fi: avainkenttä ulkoisen datan hakemiseen

source: key attribute for fetching AD user data
fi: avainkenttä AD-käyttäjätietojen hakemiseen

source: AD user data key
fi: AD-käyttäjätiedon avain

source: attribute
fi: kenttä

source: attributes
fi: kentät

source: value
fi: arvo

source: index
fi: indeksi

source: attribute value choice
fi: kentän vaihtoehto

source: attribute value choices
fi: kentän vaihtoehdot

source: automatic attribute
fi: automaattinen kenttä

source: key attribute
fi: avainkenttä

source: attribute auto value map
fi: automaattinen kentän täyttö

source: attribute auto value maps
fi: automaattiset kentän täytöt

source: attribute link
fi: kenttälinkitys

source: key
fi: avain

source: attribute auto value mapping
fi: kentän vaihtoehto

source: attribute auto value mappings
fi: kentän vaihtoehdot

source: fieldset attribute
fi: kenttäryhmän kenttä

source: fieldset attributes
fi: kenttäryhmän kentät

source: document link section
fi: dokumenttilinkkiosio

source: document link sections
fi: dokumenttilinkkiosiot

source: document name attribute
fi: dokumentin nimikenttä

source: document custom name attribute
fi: dokumentin muokatun nimen kenttä

source: document link attribute
fi: dokumentin linkkikenttä

source: document link fieldset
fi: linkitetyn dokumentin kenttäryhmä

source: document link fieldsets
fi: linkitettyjen dokumenttien kenttäryhmät

source: overview filter
fi: yleisnäkymän suodatin

source: overview filters
fi: yleisnäkymän suodattimet

source: filters project subtype overview
fi: suodattaa projektijakaumayleisnäkymää

source: filters project floor area overview
fi: suodattaa kerrosalayleisnäkymää

source: filters project map overview
fi: suodattaa karttayleisnäkymää

source: overview filter attribute
fi: yleisnäkymäsuodattimen kenttä

source: overview filter attributes
fi: yleisnäkymäsuodattimen kentät

source: phase start point
fi: vaiheen alkupiste

source: phase end point
fi: vaiheen päätepiste

source: dashed line start point
fi: katkoviivan alkupiste

source: dashed line end point
fi: katkoviivan päätepiste

source: inner line start point
fi: sisäpalkin alkupiste

source: inner line end point
fi: sisäpalkin päätepiste

source: milestone
fi: määräaikaetappi

source: abbreviation
fi: lyhenne

source: attribute for confirmation
fi: kenttä vahvistusta varten

source: deadline types
fi: määräaikatyypit

source: date type
fi: päivämäärän tyyppi

source: show if any attribute is set
fi: näytä jos mikä tahansa kentistä on täytetty

source: phase
fi: vaihe

source: subtype
fi: kokoluokka

source: error message for past due date
fi: virheilmoitus, jos päivämäärä on ohitettu

source: error message for date type mismatch
fi: virheilmoitus, jos päivämäärätyypin vaatimukset eivät täyty

source: error message for minimum distance to previous date not met
fi: virheilmoitus, jos minimietäisyys edelliseen ei täyty

source: warning message for minimum distance to next date not met
fi: varoitus, jos minimietäisyys seuraavaan ei täyty

source: Use created at as value if no attribute or calculations are specified
fi: Käytä arvona projektin luontipäivää jos kenttää tai laskusääntöjä ei ole määritelty

source: deadline
fi: määräaika

source: deadlines
fi: määräajat

source: previous deadline
fi: edellinen määräaika

source: minimum distance from previous deadline
fi: minimietäisyys edellisestä määräajasta

source: use rule if any attribute is set
fi: käytä sääntöä jos mikä tahansa kentistä on asetettu

source: base type
fi: perustuu tyyppiin

source: do not include holidays and weekends
fi: älä sisällytä pyhäpäiviä ja viikonloppuja

source: dates
fi: päivämäärät

source: automatic dates
fi: automaattiset päivämäärät

source: exclude selected dates
fi: poista valitut päivämäärät hyväksytyistä

source: date types
fi: päivämäärän tyyppi

source: monday
fi: maanantai

source: tuesday
fi: tiistai

source: wednesday
fi: keskiviikko

source: thursday
fi: torstai

source: friday
fi: perjantai

source: saturday
fi: lauantai

source: sunday
fi: sunnuntai

source: weekdays
fi: viikonpäivät

source: Invalid date(s): input date in dd.mm. format
fi: Epäkelpo päivämäärä: käytä muotoilua pp.kk.

source: week number
fi: viikkonumero

source: last day before holiday
fi: viimeinen päivä ennen pyhää

source: first day after holiday
fi: ensimmäinen päivä pyhän jälkeen

source: start date
fi: alkupäivä

source: end date
fi: loppupäivä

source: Only use one of the following: Week number, end and/or start date, last day before holiday, first day after holiday
fi: Käytä vain yhtä seuraavista: Viikkonumero, alku- ja/tai loppupäivä, viimeinen päivä ennen pyhää, ensimmäinen päivä pyhän jälkeen

source: relies on date from attribute
fi: riippuu syöttökentän päivämäärästä

source: relies on date from deadline
fi: riippuu toisesta määräaikakentästä

source: days to add
fi: lisättävien päivien määrä

source: calculation
fi: laskutoimitus

source: subtract
fi: vähennä

source: date calculation
fi: päivämäärälaskutoimitus

source: use rule if any attribute is truthy
fi: käytä sääntöä jos kentän arvo on tosi tai asetettu

source: use rule if any attribute is falsy
fi: käytä sääntöä jos kentän arvo on epätosi tai tyhjä

source: project phase
fi: projektin vaihe

source: Downloading document doesn't trigger warnings
fi: Dokumentin lataus ei aiheuta varoitusta

source: image template
fi: kuvadokumenttipohja

source: project card default template
fi: projektikortin dokumenttipohja

source: document template
fi: dokumenttipohja

source: document templates
fi: dokumenttipohjat

source: project
fi: projekti

source: Enter a valid 'identifier' consisting of Unicode letters, numbers or underscores.
fi: Syötä kelvollinen tunniste joka sisältää Unicode-kirjaimia, numeroita ja alaviivoja.

source: project type
fi: projektin tyyppi

source: project types
fi: projektin tyypit

source: project subtype
fi: projektin kokoluokka

source: project subtypes
fi: projektin kokoluokat

source: pino number
fi: pinonumero

source: attribute data
fi: kentän data

source: create principles
fi: luo periaatteet

source: create draft
fi: luo luonnos

source: projects
fi: projektit

source: project floor area section
fi: projektin kerrosalatietojen osio

source: project floor area sections
fi: projektin kerrosalatietojen osiot

source: floor area section
fi: kerrosalatietojen osio

source: relies on
fi: riippuvainen

source: project floor area section attribute
fi: projektin kerrosalatieto-osion kenttä

source: project floor area section attributes
fi: projektin kerrosalatieto-osion kentät

source: phase section
fi: vaiheen osio

source: project floor area section attribute matrix structure
fi: projektin kerrosalatieto-osion kentät

source: project floor area section attribute matrix structures
fi: projektin kerrosalatieto-osion kentät

source: color
fi: väri

source: color code
fi: värikoodi

source: list prefix
fi: listaetuliite

source: common project phase
fi: yleinen projektin vaihe

source: common project phases
fi: yleiset projektin vaiheet

source: project phases
fi: projektin vaiheet

source: project phase log entry
fi: projektivaiheen lokikirjaus

source: project phase log entries
fi: projektivaiheen lokikirjaukset

source: project phase section
fi: projektivaiheen osio

source: project phase sections
fi: projektivaiheen osiot

source: project phase section attribute
fi: projektivaiheosion kenttä

source: project phase section attributes
fi: projektivaiheosion kentät

source: project card section
fi: projektikortin osio

source: project card sections
fi: projektikortin osiot

source: date format and text
fi: päivämääräformaatti ja teksti

source: show on mobile
fi: näytä mobiilissa

source: project card section attribute
fi: projektikortin osion kenttä

source: project card section attributes
fi: projektikortin osion kentät

source: description
fi: kuvaus

source: archived at
fi: arkistoitu

source: fieldset path string
fi: kenttäryhmän polku merkkijonona

source: project attribute file
fi: projektikentän tiedosto

source: project attribute files
fi: projektikentän tiedostot

source: deadline date
fi: määräajan päivämäärä

source: deadline phase section
fi: aikataulun vaiheen osio

source: show for project owner
fi: näytä projektin vastuuhenkilölle

source: show for administrator
fi: näytä pääkäyttäjälle

source: project phase deadline section item
fi: aikataulun vaiheen osion kenttä

source: project phase deadline section items
fi: aikataulun vaiheen osion kentät

source: project phase deadline section
fi: aikataulun vaiheen osio

source: project phase deadline sections
fi: aikataulun vaiheen osiot

source: child index
fi: lapsen indeksi

source: parent fieldset
fi: emokenttäryhmä

source: target file
fi: kohdetiedosto

source: target comment
fi: kohdekommentti

source: content
fi: sisältö

source: project comment
fi: projektikommentti

source: project comments
fi: projektikommentit

source: field
fi: kenttä

source: field comment
fi: kenttäkommentti

source: field comments
fi: kenttäkommentit

source: timestamp
fi: aikaleima

source: last read timestamp
fi: viimeksi luettu

source: last read timestamps
fi: viimeksi luettu

source: can only be fetched by admin
fi: vain pääkäyttäjän haettavissa

source: show created at on report
fi: näytä luontiaika raportissa

source: show modified at on report
fi: näytä muokkausaika raportissa

source: report can be previewed
fi: raporttia voidaan esikatsella

source: hide report from other views
fi: piilota raportti muista näkymistä

source: report
fi: raportti

source: reports
fi: raportit

source: title
fi: otsikko

source: condition
fi: ehto

source: only show postfix as field value
fi: näytä pelkkä jälkiliite kentän arvona

source: include in preview
fi: näytä esikatselussa

source: only show in preview
fi: näytä vain esikatselussa

source: use column values as titles in preview
fi: käytä sarakkeen arvoja otsikkoina esikatselussa

source: map automatic display value strings to custom display values
fi: muunna automaattiset näyttöarvot muokattuihin näyttöarvoihin

source: create new column
fi: luo uuden rivin

source: report column
fi: raporttisarake

source: report columns
fi: raporttisarakkeet

source: subtypes
fi: kokoluokat

source: formatting
fi: muotoilu

source: conditions: show if...
fi: ehdot: näytä jos...

source: conditions: show if not...
fi: ehdot: näytä jos ei...

source: conditions: hide if...
fi: ehdot: piilota jos...

source: conditions: hide if not...
fi: ehdot: piilota jos ei...

source: report column postfix
fi: raporttisarakkeen jälkiliite

source: report column postfixes
fi: raporttisarakkeen jälkiliitteet

source: exact value
fi: tarkka arvo

source: value range
fi: arvoväli

source: value is set
fi: arvo on asetettu

source: value is not set
fi: arvoa ei ole asetettu

source: string
fi: teksti

source: filter type
fi: suodattimen tyyppi

source: filter input type
fi: suodattimen syöttöarvon tyyppi

source: usable with reports
fi: käytettävissä raporttien kanssa

source: target attributes
fi: kohdekentät

source: use attributes as choices
fi: käytä kenttiä vaihtoehtoina

source: report filter
fi: raporttisuodatin

source: report filters
fi: raporttisuodattimet

source: filter
fi: suodatin

source: search value, values or value range
fi: hakuvaihtoehdon arvo, arvot tai arvoväli

source: attribute choice for report filter
fi: raporttisuodattimen hakuvaihtoehto

source: attribute choices for report filters
fi: raporttisuodattimen hakuvaihtoehdot

source: Project data at selected phase start cannot be found
fi: Projektin tietoja valitun vaiheen alkuhetkenä ei löydy

source: Incorrect snapshot datetime format, use one of the following: %Y-%m-%dT%H:%M:%S.%fZ%z phase id
fi: Epäkelpo päivämäärämuotoilu, käytä jotain seuraavista: %Y-%m-%dT%H:%M:%S.%fZ%z vaiheen id

source: Project data at selected date cannot be found
fi: Projektin tietoja valittuna ajankohtana ei löydy

source: Archived projects cannot be edited
fi: Arkistoitua projektia ei voi muokata

source: Principles and drafts can only be created for XL projects.
fi: Periaatteet ja luonnos voidaan luoda vain XL-projekteille.

source: Principles and/or draft needs to be created for XL projects.
fi: Periaatteet ja/tai luonnos on luotava XL-projektille.

source: Invalid phase for project subtype, no substitute found
fi: Epäkelpo vaihe projektin kokoluokalle, vastaavaa vaihetta ei löydy

source: Selected user does not have the required role
fi: Valitulla käyttäjällä ei ole vaadittua roolia

source: Object with {slug_name}={value} does not exist.
fi: Kohdetta jonka {slug_name}={value} ei ole.

source: Character limit exceeded
fi: Merkkiraja ylittyy

source: Incorrect rich text formatting
fi: Epäkelpo tekstimuotoilu

source: Value must be unique
fi: Arvon on oltava uniikki

source: Invalid date selection for date type {attr_dl.date_type}
fi: Epäkelpo päivämäärävalinta päivämäärätyypille {attr_dl.date_type}

source: The first possible date is {date}.
fi: Ensimmäinen mahdollinen päivä on {date}.

source: Minimum distance to {distance.previous_deadline.abbreviation} not met
fi: Minimietäisyys määräaikaan {distance.previous_deadline.abbreviation} ei täyty

source: Import attribute update file
fi: projektikentän tiedosto

source: link text
fi: linkin teksti

source: section
fi: osio

source: footer link
fi: alatunnisteen linkki

source: footer links
fi: alatunnisteen linkit

source: footer section
fi: alatunnisteen osio

source: footer sections
fi: alatunnisteen osiot

source: list view attribute column
fi: listanäkymän sarakkeiden kenttä

source: list view attribute columns
fi: listanäkymän sarakkeiden kentät

source: year
fi: vuosi

source: area target
fi: kerrosalatavoite

source: hide from ui
fi: piilota käyttöliittymästä

source: show in ui
fi: näytä käyttöliittymässä

source: additional groups
fi: lisätyt ryhmät

source: AD user id
fi: AD-käyttäjä-ID
